code files/app/controllers/tasks_controller.rb

INSERT INTO "tasks" ("title", "description", "category", "importance", "collaborators", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["title", "Test"], ["description", ""], ["category", ""], ["importance", ""], ["collaborators", ""], ["created_at", "2021-01-22 18:54:20.907332"], ["updated_at", "2021-01-22 18:54:20.907332"]]
---
  def create
    @task = Task.new(task_params)

    if @task.save

SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "tasks" SET "category" = $1, "importance" = $2, "updated_at" = $3 WHERE "tasks"."id" = $4  [["category", "Project A"], ["importance", "Important"], ["updated_at", "2021-01-22 19:28:05.873395"], ["id", 4]]
---
  def update
    @task = Task.find(params[:id])

    if @task.update(task_params)