code files/app/controllers/api/v1/tasks_controller.rb

    def index
      @tasks = Task.all
---
SELECT "tasks".* FROM "tasks" ORDER BY "tasks"."created_at" DESC

    def show
      @tasks = Task.find(params[:id])
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]

    def create
      @tasks = Task.new(task_params)

      if @tasks.save
---
INSERT INTO "tasks" ("title", "description", "category", "importance", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "I hope"], ["description", "dsfjkds"], ["category", "PLEASE"], ["importance", "OTOT"], ["created_at", "2021-01-24 10:02:10.797595"], ["updated_at", "2021-01-24 10:02:10.797595"]]

    def update
      @tasks = Task.find(params[:id])

      if @tasks.update(task_params)
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "tasks" SET "title" = $1, "category" = $2, "importance" = $3, "updated_at" = $4 WHERE "tasks"."id" = $5  [["title", "Frightful Title"], ["category", "Oh Dear"], ["importance", "Important"], ["updated_at", "2021-01-24 13:38:45.697413"], ["id", 6]]

    def destroy
      @tasks = Task.find(params[:id])
      @tasks.destroy
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
DELETE FROM "tasks" WHERE "tasks"."id" = $1  [["id", 10]]

    def search
      # if params[:title].blank?
      #   # redirect_to(api_v1_tasks_path, alert: "Empty field!") and return
      # else
        # logger.debug params
      @search = params[:title].downcase
      @tags = params[:category].downcase
      @results = Task.all.where("(lower(title) LIKE :search OR lower(description) LIKE :search) AND lower(category) LIKE :tags", {search: "%#{@search}%", tags: "%#{@tags}%"})
---
SELECT "tasks".* FROM "tasks" WHERE (lower(title) LIKE 'first')